{"sample_weight_mode": null, "class_name": "Sequential", "keras_version": "1.0.5", "loss": "categorical_crossentropy", "config": [{"class_name": "Dense", "config": {"input_dim": null, "batch_input_shape": [null, 784], "W_regularizer": null, "b_constraint": null, "bias": true, "input_dtype": "float32", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activation": "linear", "init": "glorot_uniform", "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activation": "linear", "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Dense", "config": {"input_dim": null, "W_regularizer": null, "b_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "output_dim": 10, "activation": "linear", "name": "dense_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "softmax"}}], "optimizer": {"epsilon": 1e-08, "lr": 0.0010000000474974513, "name": "RMSprop", "rho": 0.8999999761581421}}